//Math. Константы.

// Math.PI - число пи, 3.141592653589793
// Math.SQRT2 - квадратный корень из двух, 1.4142135623730951
// Math. SQRT1_2 - половина от квадратного корня из двух, 0.7071067811865476
// Math.E - число Эйлера, 2.718281828459045
// Math.LN2 - натуральный логарифм числа 2, 0.6931471805599453
// Math.LN10 - натуральный логарифм числа 10, 2.302585092994046
// Math.LOG2E - двоичный логарифм числа е, 1.4426950408889634
// Math.LOG10E - десятичный логарифм числа е, 0.4342944819032518

var x = Math.log(Math.E);   //1
var z = Math.tan(Math.PI / 4); //0.9999999999999999